app/views/comments/_comment.html.haml

- if @post.comments.any?
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 12]]