app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "rrdgrdg"], ["commenter", "marat"], ["created_at", Wed, 07 Aug 2013 14:42:24 UTC +00:00], ["post_id", 3], ["updated_at", Wed, 07 Aug 2013 14:42:24 UTC +00:00]]