app/controllers/posts_controller.rb

  def update
    @post = PostType.find(params[:id])

    if @post.update(params[:post].permit(:title, :text, :state_event))
---
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["title", "gfrdgrg"], ["text", "dgdrgttfhf"], ["updated_at", Wed, 07 Aug 2013 12:58:00 UTC +00:00]]

  def destroy
    @post = PostType.find(params[:id])
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]