app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 07 Aug 2013 14:41:50 UTC +00:00], ["text", "fgh"], ["title", "fdgdfgddgd"], ["updated_at", Wed, 07 Aug 2013 14:41:50 UTC +00:00]]
---
  def create
    @post = Post.new(params[:post].permit(:title, :text))

    @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 7]]
---
  def show
    @post = Post.find(params[:id])